Revit 2024 API
IndexPoint.Index Property
 The index of the point's vertex.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public int Index { get; set; }
Visual Basic
Public Property Index As Integer
	Get
	Set
Visual C++
public:
property int Index {
	int get ();
	void set (int value);
}
See Also
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace